In [26]:
True == False

False

In [27]:
True != 0

True

In [28]:
False == 0

True

In [29]:
True or False

True

In [82]:
1 =='1'

False

In [84]:
False and True

False

In [31]:
eng = 'Korea COVID 19'
eng.lower()

'korea covid 19'

In [86]:
eng = 'Korea COVID 19'
eng.upper()

'KOREA COVID 19'

In [87]:
eng='korea'
eng.upper()

'KOREA'

In [19]:
data = []
data.append('java')
data.append('python')
data.append('c++')
data.append('crytek')
data

['java', 'python', 'c++', 'crytek']

In [20]:
data[0], data[-1], data[1:], data[:2]

('java', 'crytek', ['python', 'c++', 'crytek'], ['java', 'python'])

In [98]:
data.sort()
data

AttributeError: 'DataFrame' object has no attribute 'sort'

In [96]:
game = []
game.append('crysis1')
game.append('crysis2')
game.append('crysis3')
game

['crysis1', 'crysis2', 'crysis3']

['python', 'java', 'crytek', 'c++']

In [36]:
b=(1,2,3, '사', '오')
c=1,2,3
type(b), type(c)

(tuple, tuple)

In [41]:
b[3] = 4

TypeError: 'tuple' object does not support item assignment

In [42]:
print(b[3:], b[1:4])

('사', '오') (2, 3, '사')

In [39]:
dic = {'name1' :'경민', '학번1':20103, 'name2' :'경민2', '학번2':20104}
print(dic.get('name1'))
print(dic.keys())
print(dic.values())

경민
dict_keys(['name1', '학번1', 'name2', '학번2'])
dict_values(['경민', 20103, '경민2', 20104])

In [33]:
lunch = {'햄버거', '치킨', '라면', '콜라', 10000}
dinner = {'피자', '족발', '라면', '콜라', 10000}

In [34]:
lunch & dinner

{10000, '라면', '콜라'}

In [43]:
dinner | lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

In [44]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [46]:
import pandas as pd

In [47]:
li = [1,2,3]
li

[1, 2, 3]

In [49]:
type(li)

list

In [51]:
s1 = pd.core.series.Series(li)
s1

0    1
1    2
2    3
dtype: int64

In [53]:
s2 = pd.core.series.Series(['일','이','삼'])
s2

0    일
1    이
2    삼
dtype: object

In [54]:
data=dict(num=s1, word=s2)
data

{'num': 0    1
 1    2
 2    3
 dtype: int64, 'word': 0    일
 1    이
 2    삼
 dtype: object}

In [56]:
pd.DataFrame(data)

   num word
0    1    일
1    2    이
2    3    삼

In [64]:
data = pd.DataFrame([['a',100],['b',200],['c',300]])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
0    3 non-null object
1    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [67]:
data.head(2)

   0    1
0  a  100
1  b  200

In [69]:
data.tail(2)

   0    1
1  b  200
2  c  300

In [70]:
col = ['1군','2군']

In [73]:
pd.DataFrame([['a',100],['b',200],['c',300]],columns=col)

  1군   2군
0  a  100
1  b  200
2  c  300

In [79]:
man= [{'name':'은주','age':20, 'job':'j1'}, {'name':'민서','age':30, 'job':'j2'}, {'name':'경민','age':15, 'job':'j1'}]
pd.DataFrame(man, index=[1,2,3])

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   15  j1

In [89]:
a=[1,2,3]
b=[4,5,6]
df = [a,b]
dd=pd.DataFrame(df, index=[1,2], columns=['A', 'B', 'C'])
dd

   A  B  C
1  1  2  3
2  4  5  6